gameVault/doc/gameVault.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-06 Mon 23:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Solidity Smart Contract Documentation</title>
<meta name="author" content="Ali Nosoohi" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Solidity Smart Contract Documentation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb333995">1. GameVault Smart Contract</a>
<ul>
<li><a href="#orga88bc98">1.1. Contract Version</a></li>
<li><a href="#org1ae4fef">1.2. External Dependencies</a></li>
<li><a href="#org8c48b5d">1.3. Contract Definition</a></li>
<li><a href="#org9f125cd">1.4. State Variables</a></li>
<li><a href="#org6fcc4b7">1.5. Events</a></li>
<li><a href="#orgadaac81">1.6. Structs</a></li>
<li><a href="#org8bfa9e2">1.7. Constructor</a></li>
<li><a href="#org061c77b">1.8. External Functions</a></li>
<li><a href="#orgb5f9bcf">1.9. Internal Functions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb333995" class="outline-2">
<h2 id="orgb333995"><span class="section-number-2">1.</span> GameVault Smart Contract</h2>
<div class="outline-text-2" id="text-1">
<p>
This document provides technical details for the GameVault smart contract written in Solidity.
</p>
</div>

<div id="outline-container-orga88bc98" class="outline-3">
<h3 id="orga88bc98"><span class="section-number-3">1.1.</span> Contract Version</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Solidity Version: 0.8.19</li>
</ul>
</div>
</div>

<div id="outline-container-org1ae4fef" class="outline-3">
<h3 id="org1ae4fef"><span class="section-number-3">1.2.</span> External Dependencies</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The contract relies on external dependencies from the OpenZeppelin library:
</p>

<ul class="org-ul">
<li>[@openzeppelin/contracts-upgradeable/proxy/utils/Initializable.sol](<a href="https://github.com/OpenZeppelin/openzeppelin-contracts/blob/master/contracts/proxy/utils/Initializable.sol">https://github.com/OpenZeppelin/openzeppelin-contracts/blob/master/contracts/proxy/utils/Initializable.sol</a>)</li>
<li>[@openzeppelin/contracts-upgradeable/proxy/utils/UUPSUpgradeable.sol](<a href="https://github.com/OpenZeppelin/openzeppelin-contracts/blob/master/contracts/proxy/utils/UUPSUpgradeable.sol">https://github.com/OpenZeppelin/openzeppelin-contracts/blob/master/contracts/proxy/utils/UUPSUpgradeable.sol</a>)</li>
<li>[@openzeppelin/contracts-upgradeable/token/ERC20/utils/SafeERC20Upgradeable.sol](<a href="https://github.com/OpenZeppelin/openzeppelin-contracts/blob/master/contracts/token/ERC20/utils/SafeERC20Upgradeable.sol">https://github.com/OpenZeppelin/openzeppelin-contracts/blob/master/contracts/token/ERC20/utils/SafeERC20Upgradeable.sol</a>)</li>
<li>[@openzeppelin/contracts-upgradeable/access/AccessControlUpgradeable.sol](<a href="https://github.com/OpenZeppelin/openzeppelin-contracts/blob/master/contracts/access/AccessControlUpgradeable.sol">https://github.com/OpenZeppelin/openzeppelin-contracts/blob/master/contracts/access/AccessControlUpgradeable.sol</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org8c48b5d" class="outline-3">
<h3 id="org8c48b5d"><span class="section-number-3">1.3.</span> Contract Definition</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This contract is named &ldquo;GameVault&rdquo; and it inherits from the following OpenZeppelin modules:
</p>

<ul class="org-ul">
<li>Initializable</li>
<li>UUPSUpgradeable</li>
<li>AccessControlUpgradeable</li>
</ul>

<p>
The contract also uses the SafeERC20Upgradeable library for safe token operations.
</p>
</div>
</div>

<div id="outline-container-org9f125cd" class="outline-3">
<h3 id="org9f125cd"><span class="section-number-3">1.4.</span> State Variables</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>`tether`: An IERC20Upgradeable interface representing the Tether token contract.</li>
<li>`challengeReward`: A uint256 variable representing the challenge reward amount.</li>
<li>`playersBalance`: A mapping that stores the balance of each player&rsquo;s rewards.</li>
</ul>
</div>
</div>

<div id="outline-container-org6fcc4b7" class="outline-3">
<h3 id="org6fcc4b7"><span class="section-number-3">1.5.</span> Events</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>`ChallengeReward(uint256 challengeReward)`: Emitted when the challenge reward is set.</li>
<li>`ClaimReward(address player, uint256 amount)`: Emitted when a player claims their reward.</li>
</ul>
</div>
</div>

<div id="outline-container-orgadaac81" class="outline-3">
<h3 id="orgadaac81"><span class="section-number-3">1.6.</span> Structs</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>`PlayerInfo`: A struct that includes the following details about a player:

<ul class="org-ul">
<li>`player`: Address of the player.</li>
<li>`coefficient`: A 32-bit unsigned integer representing a coefficient for reward calculation.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8bfa9e2" class="outline-3">
<h3 id="org8bfa9e2"><span class="section-number-3">1.7.</span> Constructor</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>`initialize(address _tether, address _owner)`: Initializes the contract with the Tether token address and the contract owner. It sets the default admin role to the contract owner.</li>

<li><b><b>Return</b></b>: No explicit return value. This function is used to set initial contract state.</li>
</ul>
</div>
</div>

<div id="outline-container-org061c77b" class="outline-3">
<h3 id="org061c77b"><span class="section-number-3">1.8.</span> External Functions</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>`playersReward(PlayerInfo[] calldata _playerSet)`: Allows the contract owner (DEFAULT<sub>ADMIN</sub><sub>ROLE</sub>) to distribute rewards to players based on their coefficients.</li>

<li><b><b>Return</b></b>: No explicit return value. This function updates the `playersBalance` mapping for multiple players based on the provided `<sub>playerSet</sub>`.</li>

<li>`setChallengeReward(uint256 _challengeReward)`: Allows the contract owner to set the challenge reward amount.</li>

<li><b><b>Return</b></b>: No explicit return value. This function sets the `challengeReward` state variable to the provided `<sub>challengeReward</sub>`.</li>

<li>`claimReward()`: Allows players to claim their rewards if they have a positive balance and sufficient tokens are available in the contract.</li>

<li><b><b>Return</b></b>: No explicit return value. This function transfers rewards to the caller and updates the `playersBalance` mapping.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb5f9bcf" class="outline-3">
<h3 id="orgb5f9bcf"><span class="section-number-3">1.9.</span> Internal Functions</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>`<sub>authorizeUpgrade</sub>(address newImplementation)`: Overrides the UUPSUpgradeable function to ensure only the contract owner (DEFAULT<sub>ADMIN</sub><sub>ROLE</sub>) can authorize an upgrade.</li>

<li><b><b>Return</b></b>: No explicit return value. This function ensures that only the contract owner (DEFAULT<sub>ADMIN</sub><sub>ROLE</sub>) can authorize an upgrade by overriding the UUPSUpgradeable function.</li>
</ul>

<p>
This documentation provides an overview of the GameVault smart contract and its key components, including the detailed structure of the `PlayerInfo` struct. Please refer to the contract&rsquo;s source code for more detailed implementation details and comments.
</p>

<p>
[END OF DOCUMENT]
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: [Current Date]</p>
<p class="author">Author: Ali Nosoohi</p>
<p class="date">Created: 2023-11-06 Mon 23:06</p>
</div>
</body>
</html>